Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.AnalysisParts Property
 Gets the analysis parts of the analysis model.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObjectEnumerator AnalysisParts { get; }
Public ReadOnly Property AnalysisParts As AnalysisObjectEnumerator
	Get
Property Value
Type: AnalysisObjectEnumerator
See Also
Reference
AnalysisModel Class
Tekla.Structures.Analysis Namespace